app/controllers/todos_controller.rb

  def latest
	@latest = Todo.last
---
SELECT  "todos".* FROM "todos"   ORDER BY "todos"."id" DESC LIMIT 1

  def create
    @todo = Todo.new(todo_params)

    respond_to do |format|
      if @todo.save
---
INSERT INTO "todos" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-07-29 16:55:16.991934"], ["title", "ezf"], ["updated_at", "2014-07-29 16:55:16.991934"]]

  def update
    respond_to do |format|
      if @todo.update(todo_params)
---
UPDATE "todos" SET "title" = ?, "updated_at" = ? WHERE "todos"."id" = 3  [["title", "Super tache 1f"], ["updated_at", "2014-07-30 16:41:31.845613"]]